{
  "doc_id": "doc_2",
  "claim_idx": 2,
  "claim": "As of 2023–2024, early evidence suggests AI increases productivity and broadens access to expertise globally (e.g., consultants achieved about 40% higher-quality outputs on diverse tasks; AI can serve as an effective tutor and language aid), with disproportionately larger gains for less-skilled or underserved users, potentially reducing inequality.",
  "veracity": 88,
  "explanation": "Overall, the claim is well‑supported by early (2023–2024) evidence. Randomized field experiments show sizable performance gains and some narrowing of performance gaps: BCG’s study with 758 consultants reported ~40% higher‑quality outputs on tasks within the model’s competence; Noy & Zhang’s Science RCT found 40% faster completion and 18% higher‑quality writing with larger gains for lower‑skill participants; and a large workplace rollout of an AI assistant for 5,000+ customer support agents raised productivity 14% on average and 34% for novices. ([bcg.com](https://www.bcg.com/publications/2023/how-people-create-and-destroy-value-with-gen-ai?utm_source=chatgpt.com), [pubmed.ncbi.nlm.nih.gov](https://pubmed.ncbi.nlm.nih.gov/37440646/?utm_source=chatgpt.com), [nber.org](https://www.nber.org/papers/w31161?utm_source=chatgpt.com)) AI can broaden access to expertise: chatbots’ medical answers have been rated higher‑quality and more empathetic than physicians’ in blinded evaluations; an RCT of Tutor CoPilot improved student mastery (especially for students of lower‑rated tutors); and AI language aids like machine translation increased cross‑border trade and benefited less‑experienced buyers—evidence of reduced access frictions. ([jamanetwork.com](https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2804309%20?utm_source=chatgpt.com), [arxiv.org](https://arxiv.org/abs/2410.03017?utm_source=chatgpt.com), [nber.org](https://www.nber.org/digest/nov18/ai-improves-translation-facilitates-international-trade?utm_source=chatgpt.com)) Important caveats temper a perfect score: effects are heterogeneous (BCG also found performance worsened on “outside‑frontier” tasks), and some education trials show risks of shallow learning without careful design. ([bcg.com](https://www.bcg.com/publications/2023/how-people-create-and-destroy-value-with-gen-ai?utm_source=chatgpt.com), [axios.com](https://www.axios.com/local/san-francisco/2024/08/22/ai-tutor-bay-area-classrooms?utm_source=chatgpt.com))",
  "sources": []
}