{
  "doc_id": "3_dario_am",
  "doc_title": "3. Dario Amodei: AI's Positive Future",
  "claim_idx": 4,
  "claim": "Powerful AI will not automatically favor democracy, peace, or equitable access; AI is a dual-use technology that can strengthen both democracies and authoritarian regimes through surveillance, propaganda, and economic/military advantage, so democracies must proactively coordinate (an 'entente strategy'), secure supply chains (e.g., chip export controls), scale responsibly, and offer benefits to other countries to avoid empowering autocracies and to tilt global governance toward liberal democracy.",
  "veracity": 93,
  "explanation": "Highly accurate. Empirical evidence shows powerful AI is ‘‘dual‑use’’—it can amplify surveillance, censorship, and disinformation (thereby strengthening authoritarian control) as well as boost democratic governance and economic/military power. Human Rights Watch documents AI-driven mass surveillance in Xinjiang, and Freedom House documents how generative AI supercharges censorship and disinformation campaigns—supporting the claim that AI does not automatically favor democracy, peace, or equitable access. ([hrw.org](https://www.hrw.org/report/2019/05/01/chinas-algorithms-repression/reverse-engineering-xinjiang-police-mass?utm_source=chatgpt.com), [freedomhouse.org](https://freedomhouse.org/report/freedom-net/2023/repressive-power-artificial-intelligence?utm_source=chatgpt.com))  Governments already use supply‑chain and export controls on advanced chips to limit hostile military/AI build‑up (U.S. BIS actions), showing that “secure supply chains / chip export controls” are real policy levers. ([bis.gov](https://www.bis.gov/press-release/commerce-strengthens-export-controls-restrict-chinas-capability-produce-advanced-semiconductors-military?utm_source=chatgpt.com))  International bodies and policy analysts likewise recommend allied coordination, responsible scaling, and capacity‑building (OECD AI Principles; UN/High‑Level advisory proposals and calls for a global AI fund and capacity‑building for developing countries), supporting the prescription that democracies should coordinate, scale responsibly, and share benefits. ([oecd.org](https://www.oecd.org/en/topics/sub-issues/ai-principles.html?utm_source=chatgpt.com), [theguardian.com](https://www.theguardian.com/business/2024/sep/19/global-ai-fund-needed-to-help-developing-nations-tap-tech-benefits-un-says?utm_source=chatgpt.com))  The remaining uncertainty (why score <100) is normative and predictive: while evidence strongly supports the dual‑use risk and policy responses, outcomes depend on future political choices and implementation details; thus the claim is very well supported but not certain to be realized in every scenario.",
  "sources": []
}