{
  "doc_id": "3_dario_am",
  "doc_title": "3. Dario Amodei: AI's Positive Future",
  "claim_idx": 6,
  "claim": "Even with large technical gains, social, regulatory, and physical constraints (speed of the physical world, need for new types of data, intrinsic complexity, human institutional constraints, and physical laws) will limit how fast intelligence translates into deployed outcomes, so we should analyze 'marginal returns to intelligence' and which complementary factors (infrastructure, measurement tools, clinical trial reform, jurisdictional variation) need to be addressed to realize benefits safely.",
  "veracity": 95,
  "explanation": "This claim is well supported: evidence shows technical progress in AI does not automatically produce rapid, system‑level deployment because organizational, social and regulatory barriers slow adoption (e.g., lack of strategy, talent, data governance and integration). ([mckinsey.com](https://www.mckinsey.com/featured-insights/artificial-intelligence/ai-adoption-advances-but-foundational-barriers-remain.html?utm_source=chatgpt.com)) Empirical and industry reporting also point to diminishing marginal gains from pure model scaling and data/computation constraints, implying ‘‘more intelligence’’ can face diminishing returns without other changes. ([time.com](https://time.com/7178328/is-ai-progress-slowing-down/?utm_source=chatgpt.com), [businessinsider.com](https://www.businessinsider.com/openai-orion-model-scaling-law-silicon-valley-chatgpt-2024-11?utm_source=chatgpt.com)) Physical and domain‑specific limits (for example long drug‑development and clinical‑trial timelines measured in years/decades) constrain how fast advances translate into real products. ([lifesciences.n-side.com](https://lifesciences.n-side.com/blog/what-is-the-average-time-to-bring-a-drug-to-market-in-2022?utm_source=chatgpt.com), [cbo.gov](https://www.cbo.gov/publication/57126?utm_source=chatgpt.com)) Regulators are actively evolving frameworks (FDA, EU AI Act, national AI institutes) showing deployment depends on jurisdictional rules and that regulatory reform/clarity (and clinical‑trial guidance) is an essential complementary factor. ([fda.gov](https://www.fda.gov/news-events/press-announcements/fda-issues-comprehensive-draft-guidance-developers-artificial-intelligence-enabled-medical-devices?utm_source=chatgpt.com), [commission.europa.eu](https://commission.europa.eu/news/ai-act-enters-force-2024-08-01_en?utm_source=chatgpt.com), [time.com](https://time.com/7204670/uk-ai-safety-institute/?utm_source=chatgpt.com)) Major policy and industry analyses therefore argue for studying ‘marginal returns to intelligence’ and investing in complementary factors (infrastructure, measurement tools, trial reforms, cross‑jurisdiction coordination) to realize benefits safely — exactly the recommendation made in the claim. ([weforum.org](https://www.weforum.org/stories/2025/05/why-ai-infrastructure-and-governance-must-evolve-together/?utm_source=chatgpt.com))",
  "sources": []
}