{
  "doc_id": "4_yann_lec",
  "doc_title": "4. Yann LeCun on Open Source AI and AGI",
  "claim_idx": 6,
  "claim": "Reinforcement learning (RL) is highly sample-inefficient and should not be the primary route to general intelligence; the recommended pipeline is to learn rich representations and world models via self-supervision from observation, use model-predictive control and planning at inference time, and apply RL sparingly to adjust the model or objective when predictions fail or objectives are mis-specified.",
  "veracity": 80,
  "explanation": "Mostly true. Empirically, model-free RL is well-documented as sample‑inefficient and motivates model-based / planning alternatives. Surveys and benchmark studies highlight high sample complexity and the data‑efficiency advantages of model-based or planning approaches. ([arxiv.org](https://arxiv.org/abs/2006.16712?utm_source=chatgpt.com)) Evidence shows that learning rich representations and latent/world models (often via self‑supervised or pretraining methods) and using planning / MPC at inference can greatly improve data efficiency (PlaNet, Dreamer and follow-up pretraining-for-RL work). ([arxiv.org](https://arxiv.org/abs/1811.04551?utm_source=chatgpt.com)) In practice many teams adopt a pipeline of large‑scale representation pretraining plus limited RL fine‑tuning (e.g., RL from human feedback used to adjust objectives after supervised/pretraining phases). ([arxiv.org](https://arxiv.org/abs/2203.02155?utm_source=chatgpt.com)) However, the normative claim that RL “should not be the primary route” to general intelligence is debated: important groups continue to pursue RL‑centric or hybrid strategies (e.g., MuZero, generalist agents like Gato), so this is a well‑supported recommendation among many researchers but not a definitive consensus. ([deepmind.google](https://deepmind.google/blog/muzero-mastering-go-chess-shogi-and-atari-without-rules?utm_source=chatgpt.com), [arxiv.org](https://arxiv.org/abs/2205.06175?utm_source=chatgpt.com), [time.com](https://time.com/6694432/yann-lecun-meta-ai-interview/?utm_source=chatgpt.com))",
  "sources": []
}