{
  "doc_id": "4_yann_lec",
  "doc_title": "4. Yann LeCun on Open Source AI and AGI",
  "claim_idx": 7,
  "claim": "AI safety will be an iterative engineering problem rather than a single provable fix: practical guardrails should be integrated into objective-driven architectures (e.g., include constraints like ‘obey humans’ or ‘do no harm’ in the energy/objective function), and safety will be improved progressively through testing and refinement—analogous to how complex, high-stakes systems (like jet engines) became reliable over decades.",
  "veracity": 80,
  "explanation": "Mostly accurate (score 80). Many leading researchers and practitioners treat AI safety as an ongoing, empirical engineering problem—emphasizing iterative methods like reward modeling, scalable oversight/iterated amplification, and red‑teaming rather than expecting a single, universally provable fix. Concrete research lists and agendas (e.g., DeepMind’s “Concrete Problems in AI Safety” and Paul Christiano’s scalable-oversight ideas) explicitly frame safety as a set of practical, iterated engineering challenges.([arxiv.org](https://arxiv.org/abs/1606.06565?utm_source=chatgpt.com), [effectivealtruism.com](https://www.effectivealtruism.com/articles/paul-christiano-current-work-in-ai-alignment?utm_source=chatgpt.com)) Formal verification work (e.g., Reluplex) shows proofs are possible in restricted cases but are not yet general solutions for large, goal-directed models, so provable fixes are limited in scope today.([arxiv.org](https://arxiv.org/abs/1702.01135v1?utm_source=chatgpt.com)) Industry practice also relies on iterative testing and red‑teaming to discover and patch failures.([arxiv.org](https://arxiv.org/abs/2503.16431?utm_source=chatgpt.com)) Integrating “obey humans” or “do no harm” constraints into objectives is a common proposal, but it repeatedly runs into specification‑gaming/reward‑hacking problems—so constraints help but aren’t a panacea; that argues for progressive testing, monitoring, and hybrid approaches (empirical mitigations + formal methods + governance).([arxiv.org](https://arxiv.org/abs/1606.06565?utm_source=chatgpt.com), [en.wikipedia.org](https://en.wikipedia.org/wiki/Reward_hacking?utm_source=chatgpt.com)) The jet‑engine analogy is useful at a high level because complex engineered systems did improve reliability over decades, but AI’s goal-directed, self‑improving nature and specification‑gaming risks make the analogy imperfect — iterative engineering is necessary and likely the dominant near‑term path, but not guaranteed to be sufficient on its own.([wired.com](https://www.wired.com/2016/07/rare-look-inside-vault-rebuilt-jet-engines-prove-can-fly?utm_source=chatgpt.com))",
  "sources": []
}